In [1]:
import pathlib
import pandas as pd
import numpy as np
import tempfile
import zipfile

In [2]:
load_path = pathlib.Path("../data/train.csv.zip")

zf = zipfile.ZipFile(load_path)
with tempfile.TemporaryDirectory() as _temp_dir:
    zf.extractall(_temp_dir)

    temp_dir = pathlib.Path(_temp_dir)
    data = pd.read_csv(temp_dir / "train.csv")

In [3]:
TIME = "DateTime"
FEATURES = ["Name", "SexuponOutcome", "AnimalType", "AgeuponOutcome", "Breed", "Color"]
TARGET = "Outcome"

In [4]:
data[FEATURES].head(10)

,Name,SexuponOutcome,AnimalType,AgeuponOutcome,Breed,Color
0,Socks,Neutered Male,Cat,2 months,Domestic Shorthair Mix,Black/White
1,Vera,Intact Female,Cat,1 month,Domestic Shorthair Mix,Tortie/White
2,Biscuit,Neutered Male,Dog,3 months,Chihuahua Shorthair Mix,Yellow
3,Kitten,Spayed Female,Cat,2 years,Domestic Shorthair Mix,Calico
4,NaN,Neutered Male,Cat,2 months,Domestic Shorthair Mix,Orange Tabby
5,London,Spayed Female,Dog,1 month,Rottweiler Mix,Black/Tan
6,Dixie,Spayed Female,Dog,4 months,Chihuahua Shorthair Mix,Buff
7,NaN,Neutered Male,Dog,2 years,Chihuahua Shorthair Mix,Brown/White
8,Ruby,Spayed Female,Dog,3 years,English Coonhound/Italian Greyhound,Brown Brindle/White
9,Magnum,Neutered Male,Cat,2 years,Domestic Shorthair Mix,White/Black

In [5]:
data[TARGET].head(10)

0    0
1    3
2    2
3    0
4    0
5    0
6    0
7    3
8    0
9    1
Name: Outcome, dtype: int64

In [6]:
len(data)

18710

In [7]:
data.groupby(TARGET, as_index=False).count()

,Outcome,Name,SexuponOutcome,AnimalType,AgeuponOutcome,Breed,Color,DateTime,ID
0,0,6342,7538,7538,7538,7538,7538,7538,7538
1,1,3133,6595,6595,6583,6595,6595,6595,6595
2,2,3244,3349,3350,3350,3350,3350,3350,3350
3,3,515,1089,1089,1087,1089,1089,1089,1089
4,4,51,138,138,138,138,138,138,138

In [8]:
data["AnimalType"].unique()

array(['Cat', 'Dog'], dtype=object)

In [9]:
print(data["SexuponOutcome"].unique())

data["SexuponOutcome"] = data["SexuponOutcome"].fillna("Unknown")

print(data["SexuponOutcome"].unique())

['Neutered Male' 'Intact Female' 'Spayed Female' 'Intact Male' 'Unknown'
 nan]
['Neutered Male' 'Intact Female' 'Spayed Female' 'Intact Male' 'Unknown']

In [10]:
data["SexuponOutcome"].str.split(expand=True)

              0       1
0      Neutered    Male
1        Intact  Female
2      Neutered    Male
3        Spayed  Female
4      Neutered    Male
...         ...     ...
18705  Neutered    Male
18706    Intact    Male
18707    Spayed  Female
18708    Intact    Male
18709    Intact  Female

[18710 rows x 2 columns]

In [11]:
print(data["AgeuponOutcome"].unique())

data["AgeuponOutcome"] = data["AgeuponOutcome"].str.replace("years", "year")
data["AgeuponOutcome"] = data["AgeuponOutcome"].str.replace("months", "month")
data["AgeuponOutcome"] = data["AgeuponOutcome"].str.replace("weeks", "week")
data["AgeuponOutcome"] = data["AgeuponOutcome"].str.replace("days", "day")

splitted_age = data["AgeuponOutcome"].str.split(expand=True)
splitted_age.columns = ["num_age", "magnitude_age"]

splitted_age["num_age"] = splitted_age["num_age"].astype("float")

is_year = splitted_age["magnitude_age"] == "year"
splitted_age.loc[is_year, "num_age"] = 365 * splitted_age.loc[is_year, "num_age"]
is_month = splitted_age["magnitude_age"] == "month"
splitted_age.loc[is_month, "num_age"] = 30 * splitted_age.loc[is_month, "num_age"]
is_week = splitted_age["magnitude_age"] == "week"
splitted_age.loc[is_week, "num_age"] = 7 * splitted_age.loc[is_week, "num_age"]

mean_num_age = splitted_age["num_age"].mean(skipna=True)

splitted_age["num_age"] = splitted_age["num_age"].fillna(mean_num_age)
is_zero = splitted_age["num_age"] == 0.0
splitted_age.loc[is_zero, "num_age"] = mean_num_age

splitted_age["num_age"] = np.log(splitted_age["num_age"])
splitted_age["num_age"] = splitted_age["num_age"] - np.mean(splitted_age["num_age"])

splitted_age["magnitude_age"] = splitted_age["magnitude_age"].fillna("Unknown")

processed = pd.concat([data, splitted_age], axis=1)
processed.drop(columns="AgeuponOutcome", inplace=True)

splitted_age

['2 months' '1 month' '3 months' '2 years' '4 months' '3 years' '5 years'
 '8 months' '7 years' '1 weeks' '4 years' '1 year' '4 weeks' '6 years'
 '13 years' '8 years' '9 months' '6 months' '10 months' '9 years'
 '3 weeks' '2 weeks' '10 years' '3 days' '5 months' '2 days' '11 years'
 '12 years' '15 years' '14 years' '1 week' '1 day' '11 months' '16 years'
 '7 months' '18 years' '6 days' nan '5 weeks' '5 days' '17 years' '4 days'
 '0 years' '19 years' '20 years']

        num_age magnitude_age
0     -1.550950         month
1     -2.244098         month
2     -1.145485         month
3      0.947749          year
4     -1.550950         month
...         ...           ...
18705 -0.298188         month
18706 -1.145485         month
18707  0.947749          year
18708  0.947749          year
18709 -1.550950         month

[18710 rows x 2 columns]

In [12]:
data["Name"] = data["Name"].str.replace(" ", "")
data.groupby("Name")["ID"].count()

Name
007           1
3Buster       1
Aaron         1
AaronElvis    1
Abbadon       1
             ..
Zuko          1
Zulma         1
Zulu          1
Zuzu          1
Zz            1
Name: ID, Length: 5061, dtype: int64

In [13]:
colors = data["Color"].str.split(pat="/", expand=True)
colors.columns = ["First_color", "Second_color"]

colors[["First_color", "Second_color"]] = colors[["First_color", "Second_color"]].fillna("Unknown")
colors

        First_color   Second_color
0             Black          White
1            Tortie          White
2            Yellow        Unknown
3            Calico        Unknown
4      Orange Tabby        Unknown
...             ...            ...
18705     Chocolate          White
18706           Tan        Unknown
18707         White  Brown Brindle
18708         Black        Unknown
18709         Black        Unknown

[18710 rows x 2 columns]

In [14]:
pd.DataFrame(np.sort(colors.values, axis=1), columns=colors.columns)

         First_color Second_color
0              Black        White
1             Tortie        White
2            Unknown       Yellow
3             Calico      Unknown
4       Orange Tabby      Unknown
...              ...          ...
18705      Chocolate        White
18706            Tan      Unknown
18707  Brown Brindle        White
18708          Black      Unknown
18709          Black      Unknown

[18710 rows x 2 columns]

In [18]:
data.groupby("Outcome")["Outcome"].count()

Outcome
0    7538
1    6595
2    3350
3    1089
4     138
Name: Outcome, dtype: int64

In [22]:
7538 / 6595

1.1429871114480668